// src/pages/content.js

export const slidesContent = [
  { image: require('../assets/images/1.png'), caption: 'คุ้มครองครบวงจร มั่นใจทุกก้าว' },
  { image: require('../assets/images/2.png'), caption: 'อนาคตมั่นคง เริ่มต้นด้วยการวางแผนที่ดี' },
  { image: require('../assets/images/3.png'), caption: 'ปกป้องคุณและครอบครัว ด้วยประกันภัยที่ไว้ใจได้' },
  { image: require('../assets/images/4.png'), caption: 'เลือกความคุ้มครองที่เหมาะกับคุณ เพื่อชีวิตที่ไร้กังวล' },
];

export const accordionContent = [
  {
    title: "คำถามที่พบบ่อย?",
    content: "ตัวแทนประกันภัยทำงานโดยตรงกับบริษัทเดียว ดังนั้นพวกเขาจะนำเสนอผลิตภัณฑ์ของบริษัทนั้นเท่านั้น ในขณะที่นายหน้าประกันภัยทำงานเป็นอิสระและสามารถเสนอผลิตภัณฑ์จากหลายบริษัทได้ ซึ่งทำให้ลูกค้ามีทางเลือกมากขึ้น หากคุณต้องการความคุ้มครองที่หลากหลาย นายหน้าประกันภัยอาจเป็นตัวเลือกที่เหมาะสม",
  },
  {
    title: "นายหน้าประกันภัย (Broker) คือใคร?",
    content: "นายหน้าประกันภัย เป็นบุคคลอิสระที่ไม่ขึ้นกับบริษัทประกันภัยใดบริษัทหนึ่ง นายหน้าอาจเป็นบุคคลธรรมดาหรือนิติบุคคลก็ได้ ความสำคัญของนายหน้าคือการสามารถเสนอขายประกันภัยจากหลายบริษัท ทำให้นายหน้าสามารถเลือกผลิตภัณฑ์ที่หลากหลายให้ลูกค้าได้ โดยเน้นการให้ความคุ้มครองที่ตรงกับความต้องการของลูกค้า ข้อแตกต่างอีกอย่างหนึ่งคือ หลังจากที่นายหน้าขายประกันเสร็จสิ้นแล้ว นายหน้าไม่จำเป็นต้องรับผิดชอบดูแลลูกค้าในภายหลัง เพราะหน้าที่นี้จะตกเป็นของบริษัทประกันภัยที่ลูกค้าเลือกใช้บริการสรุปง่าย ๆ ก็คือ นายหน้าประกันภัยสามารถขายประกันจากหลายบริษัทได้",
  },
  {
    title: "เลือกตัวแทน หรือ นายหน้า อย่างไรดี?",
    content: "เมื่อคุณทราบถึงความแตกต่างระหว่างตัวแทนประกันภัยและนายหน้าประกันภัยแล้ว คุณสามารถเลือกตามความต้องการและความสะดวกของคุณ หากคุณต้องการความคุ้มครองจากหลายบริษัท การเลือกนายหน้าอาจเป็นตัวเลือกที่ดี แต่ถ้าคุณต้องการบริการที่ครบวงจรจากบริษัทประกันภัยเพียงแห่งเดียว การเลือกตัวแทนประกันภัยอาจเหมาะสมกว่า ไม่ว่าคุณจะเลือกวิธีใด อย่าลืมศึกษาข้อมูลให้รอบคอบก่อนตัดสินใจ หรือหากคุณต้องการคำปรึกษาเพิ่มเติม เรายินช่วยเหลือคุณเสมอ",
  },
];